[
  {
    "title": ".NET Developer",
    "from": "2024-04-01",
    "to": null,
    "company": "Positioner",
    "location": "Ticino, Switzerland (remote)",
    "description": "- Engineered and managed the full-stack development and maintenance for dozens of .NET Umbraco websites, ensuring feature delivery and high availability.\n\n- Optimized and maintained the company's Azure infrastructure, leveraging services like Azure App Service, Functions, and App Insights to achieve operational efficiency and continuous operation.\n\n- Designed and implemented robust REST APIs using C# and .NET to integrate hospitality systems, supporting critical business procedures.\n\n- Improved team development velocity by improving or introducing the usage of tools such as GitHub Workflows and Gemini CLI, to standardize best practices and automate tasks.\n\n- Supported company growth by providing technical analysis for new service offerings and contributing to expanding the market value proposition."
  },
  {
    "title": "Software Developer / Configurator",
    "from": "2023-10-01",
    "to": "2024-04-01",
    "company": " Yarowa (through Forty2)",
    "location": "Lisbon, Portugal",
    "description": "- Delivered custom solutions by configuring the company’s proprietary JSON-based mechanism to accurately meet complex customer requirements.\n\n- Increased configuration efficiency and ensured solution quality by implementing testing and static validation tools, including Playwright, Puppeteer, and JSON Schema."
  },
  {
    "title": "Azure DevOps Support Engineer",
    "from": "2022-09-01",
    "to": "2023-07-01",
    "company": "Microsoft",
    "location": "Lisbon, Portugal",
    "description": "- Resolved complex customer issues across Azure DevOps Server and Services, ensuring the best experience of usage and migration for enterprise clients.\n\n- Provided expert support for optimization and testing services, including Azure DevTest Labs and Azure Load Testing.\n\n-Expanded foundational knowledge in essential cloud computing tools, including Azure VM and Azure SQL Server, to effectively diagnose and resolve customer issues across the Azure DevOps ecosystem."
  },
  {
    "title": ".NET Developer",
    "from": "2020-09-01",
    "to": "2022-08-01",
    "company": "WorldIT, Consulting Services",
    "location": "Lisbon, Portugal",
    "description": "Year 1: Collaborated on a team to develop and maintain client websites, contributing to bug fixes, feature additions, and new site development using .NET, C#, HTML, CSS, and SQL Server.\n\nYear 2: Single-handedly designed, developed, and tested internal-use portals for the engineering company ISQ, leveraging Blazor and the .NET stack. These self-service portals successfully automated the management of critical functions, including company car toll payments and employee data management, improving internal operational efficiency."
  },
  {
    "title": "MSc’s dissertation",
    "from": "2019-06-01",
    "to": "2020-03-01",
    "company": "WorldIT, Consulting Services",
    "location": "Lisbon, Portugal",
    "description": "- Engineered an innovative web tool that provides internet connection fault tolerance by utilizing next page prediction.\n\n- Implemented the solution using a JavaScript Service Worker to prefetch and cache pages, enabling users to continue browsing seamlessly even during lost or unstable connections.\n\n- Developed a dedicated web benchmarking page to rigorously evaluate the performance and accuracy of the prediction tool.\n\n- Documented the project findings and methodology in Latex, adhering to academic standards."
  },
  {
    "title": "Internship",
    "from": "2017-11-01",
    "to": "2018-02-01",
    "company": "WorldIT, Consulting Services",
    "location": "Lisbon, Portugal",
    "description": "- Developed Augmented Reality (AR) street navigation native applications for both Android and iOS mobile platforms.\n\n- Implemented AR functionality using ARKit (iOS) and ARCore (Android) to overlay navigational markers onto live video feeds.\n\n- Utilized Swift, Java, and the Google Maps SDK to build, test, and deliver the mobile applications."
  }
]